// src/lib/belbin-data.ts

export type BelbinAnswer = {
    id: string;
    text: string;
    role: string;
};

export type BelbinQuestion = {
    id: number;
    question: string;
    answers: BelbinAnswer[];
};

export const belbinQuestions: BelbinQuestion[] = [
    {
        id: 1,
        question: "وقتی در یک کار گروهی شرکت می کنم:",
        answers: [
            { id: "q1_opt1", text: "براي برنامه‌ريزي كار من فرد قابل اطميناني هستم.", role: "Role1" },
            { id: "q1_opt2", text: "من به تمام نكات حتي نكاتي كه ديگران از ديدن آن عاجزند توجه مي‌كنم.", role: "Role2" },
            { id: "q1_opt3", text: "هنگامي كه در جلسات، بحث از موضوع منحرف مي‌شود من به شدت واكنش نشان مي‌دهم.", role: "Role3" },
            { id: "q1_opt4", text: "پيشنهادهاي من خلاقانه و غير تكراري است.", role: "Role4" },
            { id: "q1_opt5", text: "من عقايد ديگران را به خوبي تحليل مي‌كنم و بدون در نظر گرفتن عقايد شخصي به نكات مثبت و منفي آن توجه مي‌كنم.", role: "Role5" },
            { id: "q1_opt6", text: "من در مورد مطلع شدن از آخرين دستاوردها و نتايج خروجي كار بسيار دقيق هستم.", role: "Role6" },
            { id: "q1_opt7", text: "استعداد من در سازمان‌دهي انسان‌ها است.", role: "Role7" },
            { id: "q1_opt8", text: "من همیشه پشتيبان پيشنهادهايي هستم كه مي‌تواند به حل يك مشكل كمك كند.", role: "Role8" }
        ]
    },
    {
        id: 2,
        question: "از شرکت در کارهای گروهی، احساس رضايت مي‌نمايم زيرا:",
        answers: [
            { id: "q2_opt1", text: "من می‌توانم درتصميم‌گيري، تأثیر به‌سزایی داشته باشم.", role: "Role1" },
            { id: "q2_opt2", text: "من در كارهايي كه نياز به توجه و تمركز بسيار دارد بسيار موفق هستم.", role: "Role2" },
            { id: "q2_opt3", text: "تمايل بسياري به حل مشكلات همكاران دارم.", role: "Role3" },
            { id: "q2_opt4", text: "تمايل دارم بين راه حل‌هاي گوناگون به شکل انتقادپذيري تمايز قايل شوم.", role: "Role4" },
            { id: "q2_opt5", text: "علاقه به رويكردهاي مبتكرانه در حل مشكلات دارم.", role: "Role5" },
            { id: "q2_opt6", text: "علاقه‌مند هستم بين عقايد مختلف، فصل مشترك پيدا كنم.", role: "Role6" },
            { id: "q2_opt7", text: "تمايل من بيشتر به اجراي كارهاست تا ايجاد عقايد جديد و تصميم‌گيري.", role: "Role7" },
            { id: "q2_opt8", text: "من به شدت علاقه‌مند به پيدا كردن روش‌هاي نو و عقايد و تكنيك‌هاي جديد مي‌باشم.", role: "Role8" }
        ]
    },
    {
        id: 3,
        question: "هنگامي كه در کارها با گروه مشكلات پيچيده‌اي روبرو می شوم:",
        answers: [
            { id: "q3_opt1", text: "من به دقت به نكاتي توجه دارم كه مي‌تواند باعث بوجود آمدن مشكل باشد.", role: "Role1" },
            { id: "q3_opt2", text: "من به دنبال عقايدي هستم كه در دراز مدت كاركرد بيشتري دارد تا اينكه خود را يا كار را با اقدامات فوري، رفع و رجوع كنم.", role: "Role2" },
            { id: "q3_opt3", text: "تمايل به ارزيابي و مقايسه پيشنهادهاي مختلف قبل از انتخاب دارم.", role: "Role3" },
            { id: "q3_opt4", text: "من قادر به هماهنگي و استفاده موثر از توانايي‌ها و عقايد ديگران هستم.", role: "Role4" },
            { id: "q3_opt5", text: "رويكرد من يك روش سيستماتيك مي‌باشد، صرف‌نظر از اينكه شرايط چقدر پيچيده است.", role: "Role5" },
            { id: "q3_opt6", text: "روش من خلق يك رويكرد جديد در حل مشكلات دراز مدت است.", role: "Role6" },
            { id: "q3_opt7", text: "در صورت نياز براي بازشناسايي عقايد خود توسط ديگران،‌ معتقد به اعمال زور نيز هستم.", role: "Role7" },
            { id: "q3_opt8", text: "آماده كمك كردن هستم. هر وقت كه از من كمك خواسته شود.", role: "Role8" }
        ]
    },
    {
        id: 4,
        question: "در اجراي وظائف روزمره:",
        answers: [
            { id: "q4_opt1", text: "بسيار هوشيار هستم كه هيچ نكته مبهم و نامشخص در انجام وظائف و مسئوليت‌ها وجود نداشته باشد.", role: "Role1" },
            { id: "q4_opt2", text: "در جلسات، از نقطه نظرهاي خود كوتاه نمي‌آيم.", role: "Role2" },
            { id: "q4_opt3", text: "من با همه افراد آماده همكاري هستم،‌ به شرطي که آنها چيزي با ارزشي براي ارائه و مشارك داشته باشند.", role: "Role3" },
            { id: "q4_opt4", text: "من متمايل به پيگيري امور مربوط به ايده‌هاي جالب يا افراد مهم و خاص هستم.", role: "Role4" },
            { id: "q4_opt5", text: "من به دنبال دلايل محكم براي رد كردن نظرات و پيشنهادهاي غيرمنطقي هستم.", role: "Role5" },
            { id: "q4_opt6", text: "من قادر به مشاهده ايده‌هايي هستم كه در نظر ديگران غيرمرتبط هستند و به آن توجهي نمي‌کنند.", role: "Role6" },
            { id: "q4_opt7", text: "مشغول بودن به كار به من حس رضايت مي‌دهد.", role: "Role7" },
            { id: "q4_opt8", text: "علاقه‌مندم انسان‌هاي ديگر را بهتر بشناسم.", role: "Role8" }
        ]
    },
    {
        id: 5,
        question: "هنگامي كه به من مسئوليت سختي همراه با زمان محدود و افراد ناآشنا به كار داده مي‌شود:",
        answers: [
            { id: "q5_opt1", text: "اغلب دچار سرخوردگي از كار در گروه مي‌شوم.", role: "Role1" },
            { id: "q5_opt2", text: "توانايي‌هاي شخصي خود را بيشتر اوقات براي دستيابي به توافق مناسب مي‌بينم.", role: "Role2" },
            { id: "q5_opt3", text: "احساسات من اكثر اوقات با قضاوت‌هاي من تداخل پيدا مي‌كند.", role: "Role3" },
            { id: "q5_opt4", text: "تلاش من براي به دست آوردن ساختاري مناسب و موثر است.", role: "Role4" },
            { id: "q5_opt5", text: "من قادر به ادامه همكاري با افراد با ويژگي‌هاي شخصي مختلف و عقايد گوناگون هستم.", role: "Role5" },
            { id: "q5_opt6", text: "عقيده دارم كه روبه‌رو شدن با عدم محبوبيت كوتاه مدت من ارزش اين را دارد كه عقايد خود را در گروه اعمال كنم.", role: "Role6" },
            { id: "q5_opt7", text: "اكثراً قادر به شناسايي افرادي هستم كه داراي دانش اختصاصي منحصر به فردي مي‌باشند.", role: "Role7" },
            { id: "q5_opt8", text: "قادر به تشخيص مواقع اضطراري مي‌باشم.", role: "Role8" }
        ]
    },
    {
        id: 6,
        question: "هنگامي كه درخواست رسيدگي به پروژه‌اي جديد را دريافت مي‌كنم:",
        answers: [
            { id: "q6_opt1", text: "به دنبال عقايد جديد و راه‌هاي جديد براي بدست آوردن اطلاعات تازه، اطراف خود را جستجو مي‌كنم.", role: "Role1" },
            { id: "q6_opt2", text: "قبل از اينكه شروع به كار كنم، نگرانی اتمام و تكميل نمودن كار جديد محول شده را دارم.", role: "Role2" },
            { id: "q6_opt3", text: "به يك روش تحليلي با دقت به مقابله با مشكل جديد مي‌روم.", role: "Role3" },
            { id: "q6_opt4", text: "در صورت نياز، آماده جلب همكاري ديگران هستم.", role: "Role4" },
            { id: "q6_opt5", text: "در اكثر شرايط، قادر به پيدا نمودن رويكردي مستقل و نگاهي نو مي‌باشم.", role: "Role5" },
            { id: "q6_opt6", text: "خوشحال مي‌شوم در زماني كه نياز به انجام اقدام باشد، هدايت تيم را به عهده يگيرم.", role: "Role6" },
            { id: "q6_opt7", text: "قادر به پذيرش همكاران جديد و عقايد و طرح‌هاي نو آنها هستم.", role: "Role7" },
            { id: "q6_opt8", text: "براي من مشكل است كاري كه اهدافش را به درستي تعيين نكرده‌اند را بپذيرم.", role: "Role8" }
        ]
    },
    {
        id: 7,
        question: "براي همكاري و شركت در كارهاي گروهي به طور كلي:",
        answers: [
            { id: "q7_opt1", text: "استعداد كافي براي تعريف قدم‌هاي اساسي و ضروري كه بايد برداشته شود و شرح مختصري از بايد و نبايدها را دارم.", role: "Role1" },
            { id: "q7_opt2", text: "قضاوت و داوري من هر چند كه زمان‌گير است ولي اغلب اوقات نزديك به هدف است.", role: "Role2" },
            { id: "q7_opt3", text: "براي روش كاري من، طيف وسيعي از ارتباطات گروهي ضروري و مورد نياز است.", role: "Role3" },
            { id: "q7_opt4", text: "نيم نگاهي به جزئيات مطلب را نيز دارم.", role: "Role4" },
            { id: "q7_opt5", text: "سعي دارم عقايد خود را در جلسات گروهي مطرح كنم.", role: "Role5" },
            { id: "q7_opt6", text: "توانايي آن را دارم كه بدانم چگونه مي‌توان عقايد و تكنيك‌ها را در ايجاد ارتباطات جديد به‌كار گرفت.", role: "Role6" },
            { id: "q7_opt7", text: "تمام ابعاد مشكلات را مي‌بينم و تصميماتي مي‌گيرم كه در تمام موارد قابل اجرا خواهد بود.", role: "Role7" },
            { id: "q7_opt8", text: "با ديگران كنار مي‌آيم و به سختي براي موفقيت گروه تلاش مي‌كنم.", role: "Role8" }
        ]
    }
];

